# uae_aid_dashboard/Home.py
import streamlit as st

st.set_page_config(
    layout="wide",
    page_title="UAE Foreign Aid Hub",
    page_icon="🇦🇪",
    initial_sidebar_state="expanded"
)

st.title("مرحبًا بك في مركز بيانات المساعدات الخارجية لدولة الإمارات 🇦🇪")
st.markdown("---")
st.image("world_map.jpg", caption="خريطة العالم: انتشار المساعدات الإماراتية", use_container_width =True)
st.markdown("---")
st.write(
    """
    تُقدم لوحة المعلومات هذه نظرة شاملة وتفاعلية على اتجاهات المساعدات الخارجية لدولة الإمارات العربية المتحدة
    خلال السنوات من 2021 إلى 2026.
    استخدم الشريط الجانبي الأيسر للتنقل بين الأقسام المختلفة:

    * **نظرة عامة على لوحة المعلومات:** لعرض الاتجاهات الرئيسية والمقاييس بمرور الوقت.
    * **مخططات الانتشار:** لاستكشاف العلاقات بين المتغيرات المختلفة.
    * **المخططات الدائرية:** لتحليل توزيع المساعدات عبر الفئات المتعددة.

    نتمنى لك تجربة استكشاف مفيدة!
    """
)

st.info("ملاحظة: البيانات المستخدمة هنا هي لأغراض العرض التوضيحي وقد لا تكون دقيقة 100%.")
